UNF_KlK.КИТ_ДОК/src/InformationRegisters/СоотвествиеСечений/СоотвествиеСечений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоотвествиеСечений</name>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Толщина</name>
    <type>
      <types>CatalogRef.Толщины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ширина</name>
    <type>
      <types>CatalogRef.Ширины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNF_KlK.КИТ_ДОК/src/Enums/ВидыРеквизита/ВидыРеквизита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРеквизита</name>
  <enumValues>
    <name>ПФ</name>
  </enumValues>
  <enumValues>
    <name>ГП</name>
  </enumValues>
</mdclass:Enum>

UNF_KlK.КИТ_ДОК/src/Catalogs/Длины/Длины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Длины</name>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиапозонДлин</name>
    <type>
      <types>CatalogRef.ДиапзоныДлин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаХарактеристика</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРеквизита</name>
    <type>
      <types>EnumRef.ВидыРеквизита</types>
    </type>
  </attributes>
</mdclass:Catalog>

UNF_KlK.КИТ_ДОК/src/CommonModules/КИТ_РаботаСДаннымиСервер/Module.bsl
Функция ПолучениеХарактерстикиКруглогоЛесоматериала(ЗначениеДиаметр,ЗначениеПорода,ЧислоДлина,Номенклатура) Экспорт
	
	ЗначениеДлина = ПолучитьЗначениеХарактеристикиДлина(ЧислоДлина);
	
	ХарактеристикаПоиска = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1 КАК КоличествоВхождений
		|ПОМЕСТИТЬ ВР_Выборка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеПорода
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоПорода
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеДиаметр
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоДиаметр
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеДлина
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоДлина
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Выборка.ХарактеристикаПоиска,
		|	СУММА(ВР_Выборка.КоличествоВхождений) КАК КоличествоВхождений
		|ПОМЕСТИТЬ ВР_Группировка
		|ИЗ
		|	ВР_Выборка КАК ВР_Выборка
		|СГРУППИРОВАТЬ ПО
		|	ВР_Выборка.ХарактеристикаПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Группировка.ХарактеристикаПоиска
		|ИЗ
		|	ВР_Группировка КАК ВР_Группировка
		|ГДЕ
		|	ВР_Группировка.КоличествоВхождений = 3";
	
	Запрос.УстановитьПараметр("СвойствоДлина", ЗначениеДлина.Владелец);
	Запрос.УстановитьПараметр("СвойствоДиаметр", Константы.СвойствоДляДиаметра.Получить());
	Запрос.УстановитьПараметр("ЗначениеДлина", ЗначениеДлина);
	Запрос.УстановитьПараметр("ЗначениеДиаметр", ЗначениеДиаметр);
	Запрос.УстановитьПараметр("ЗначениеПорода", ЗначениеПорода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СвойствоПорода", Константы.СвойствоДляПород.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Характеристикапоиска = ВыборкаДетальныеЗаписи.ХарактеристикаПоиска;	
	КонецЦикла;
	
	Если не ЗначениеЗаполнено(Характеристикапоиска) Тогда
		ХарактеристикаНовая = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		ХарактеристикаНовая.Владелец = Номенклатура;
		
		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = Константы.СвойствоДляДиаметра.Получить();
		СтрокаДопРеквизит.Значение = ЗначениеДиаметр;
		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = Константы.СвойствоДляПород.Получить();
		СтрокаДопРеквизит.Значение = ЗначениеПорода;
		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = ЗначениеДлина.Владелец;
		СтрокаДопРеквизит.Значение = ЗначениеДлина;	
		
		ХарактеристикаНовая.Наименование = ""+ЗначениеДиаметр +", "+ЗначениеПорода +", "+ЗначениеДлина;
		ХарактеристикаНовая.НаименованиеДляПечати = ""+ЗначениеДиаметр +", "+ЗначениеПорода +", "+ЗначениеДлина;		
		//ШаблоныНаименований.СформироватьНаименования(ХарактеристикаНовая, Истина);
		
		ХарактеристикаНовая.Записать();
		Характеристикапоиска = ХарактеристикаНовая.Ссылка;
	КонецЕсли;
	
	Возврат Характеристикапоиска;	
Конецфункции

Функция ПолучениеХарактерстикиПиломатериалов(Порода,Толщина,Ширина,Сорт,Длина,Влажность,Номенклатура,Отказ) Экспорт
	ХарактеристикаПоиска = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	
	Сечение = НайтиСечение(Толщина,Ширина);
	Если Не ЗначениеЗаполнено(Сечение) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не найдено значение сечения для "+Толщина+"мм и "+Ширина+"мм");
		Возврат ХарактеристикаПоиска;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1 КАК КоличествоВхождений
		|ПОМЕСТИТЬ ВР_Выборка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеПорода
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоПорода
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеСорт
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоСорт
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеСечение
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоСечение
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеВлажность
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоВлажность
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикаПоиска,
		|	1
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение = &ЗначениеДлина
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвойствоДлина
		|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Выборка.ХарактеристикаПоиска,
		|	СУММА(ВР_Выборка.КоличествоВхождений) КАК КоличествоВхождений
		|ПОМЕСТИТЬ ВР_Группировка
		|ИЗ
		|	ВР_Выборка КАК ВР_Выборка
		|СГРУППИРОВАТЬ ПО
		|	ВР_Выборка.ХарактеристикаПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВР_Группировка.ХарактеристикаПоиска
		|ИЗ
		|	ВР_Группировка КАК ВР_Группировка
		|ГДЕ
		|	ВР_Группировка.КоличествоВхождений = 5";
	
	Запрос.УстановитьПараметр("СвойствоДлина", Длина.ДлинаХарактеристика.Владелец);
	Запрос.УстановитьПараметр("ЗначениеДлина", Длина.ДлинаХарактеристика);

	

	Запрос.УстановитьПараметр("СвойствоВлажность", Влажность.Владелец);
	Запрос.УстановитьПараметр("ЗначениеВлажность", Влажность);

	Запрос.УстановитьПараметр("СвойствоСечение", Сечение.Владелец);
	Запрос.УстановитьПараметр("ЗначениеСечение", Сечение);
	
	Запрос.УстановитьПараметр("СвойствоСорт", Сорт.Владелец);
	Запрос.УстановитьПараметр("ЗначениеСорт", Сорт);

	Запрос.УстановитьПараметр("СвойствоПорода", Порода.Владелец);
	Запрос.УстановитьПараметр("ЗначениеПорода", Порода);
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Характеристикапоиска = ВыборкаДетальныеЗаписи.ХарактеристикаПоиска;	
	КонецЦикла;
	
	Если не ЗначениеЗаполнено(Характеристикапоиска) Тогда
		ХарактеристикаНовая = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		ХарактеристикаНовая.Владелец = Номенклатура;
		
		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = Порода.Владелец;
		СтрокаДопРеквизит.Значение = Порода;
		
		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = Сорт.Владелец;
		СтрокаДопРеквизит.Значение = Сорт;

		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = Сечение.Владелец;
		СтрокаДопРеквизит.Значение = Сечение;

		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = Влажность.Владелец;
		СтрокаДопРеквизит.Значение = Влажность;
	
		СтрокаДопРеквизит = ХарактеристикаНовая.ДополнительныеРеквизиты.Добавить();
		СтрокаДопРеквизит.Свойство = Длина.ДлинаХарактеристика.Владелец;
		СтрокаДопРеквизит.Значение = Длина.ДлинаХарактеристика;
		
		ХарактеристикаНовая.Наименование = ""+Порода +", "+Сорт +", "+Сечение+", "+Длина+", "+Влажность;
		ХарактеристикаНовая.НаименованиеДляПечати = ""+Порода +", "+Сорт +", "+Сечение+", "+Длина+", "+Влажность;		
		//ШаблоныНаименований.СформироватьНаименования(ХарактеристикаНовая, Истина);
		
		ХарактеристикаНовая.Записать();
		Характеристикапоиска = ХарактеристикаНовая.Ссылка;
	КонецЕсли;
	
	Возврат Характеристикапоиска;	
Конецфункции

Функция ПолучитьЗначениеХарактеристикиДлина(ЧислоДлина)

	ДлинаХарактеристика = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Длины.ДлинаХарактеристика
		|ИЗ
		|	Справочник.Длины КАК Длины
		|ГДЕ
		|	Длины.Длина = &ЧислоДлина
		|	И Длины.ВидРеквизита = &ВидРеквизита";
	
	Запрос.УстановитьПараметр("ВидРеквизита", Перечисления.ВидыРеквизита.ПФ);
	Запрос.УстановитьПараметр("ЧислоДлина", ЧислоДлина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДлинаХарактеристика = ВыборкаДетальныеЗаписи.ДлинаХарактеристика;	
	КонецЦикла;
	
	Возврат ДлинаХарактеристика;

КонецФункции

Функция ОбъемВычислить(КоличествоДосок, Толщина, Ширина, Длина)  Экспорт   
	Объем = 0;	
	Попытка  
		Объем = Окр(КоличествоДосок * Толщина.Толщина * Ширина.Ширина * Длина.Длина / 1000000, 2);
	Исключение		
	КонецПопытки;
	
	Возврат(Объем);
	
КонецФункции

Функция НайтиСечение(Толщина,Ширина) Экспорт
	
	Сечение = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоотвествиеСечений.Сечение КАК Сечение
		|ИЗ
		|	РегистрСведений.СоотвествиеСечений КАК СоотвествиеСечений
		|ГДЕ
		|	СоотвествиеСечений.Толщина = &Толщина
		|	И СоотвествиеСечений.Ширина = &Ширина";

	Запрос.УстановитьПараметр("Толщина", Толщина);
	Запрос.УстановитьПараметр("Ширина", Ширина);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сечение = ВыборкаДетальныеЗаписи.Сечение;
	КонецЦикла;

	Возврат Сечение;

КонецФункции

//Поиск серии и создание. Связка Номенклатура + Характеристика + Серия
Функция НайтиСериюНоменклатуры(КодСерии,НоменклатураСерии) Экспорт
	СерияПакета = Справочники.СерииНоменклатуры.ПустаяСсылка();
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК СЕРИЯ
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Наименование = &СерийныйНомер
		|	И СерииНоменклатуры.Владелец = &Владелец";

	Запрос.УстановитьПараметр("СерийныйНомер", КодСерии);
	Запрос.УстановитьПараметр("Владелец", НоменклатураСерии);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СерияПакета = ВыборкаДетальныеЗаписи.СЕРИЯ;		
	КонецЦикла;

	Если Не ЗначениеЗаполнено(СерияПакета) Тогда
		
		СерияПакетОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		СерияПакетОбъект.Владелец = НоменклатураСерии;
		СерияПакетОбъект.Наименование = КодСерии;
		СерияПакетОбъект.Записать();
		СерияПакета = СерияПакетОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СерияПакета;
	
КонецФункции

Функция ДанныеПакета(Пакет) Экспорт
	
	СтруктураПакета = Новый Структура("Стандарт,КоличествоДосок,Номенклатура,ХарактеристикаНоменклатуры,Влажность,Длина,Ширина,Толщина,Объем");
	СтруктураПакета.Стандарт = Пакет.Стандарт;
	СтруктураПакета.КоличествоДосок = Пакет.КоличествоДосок;
	СтруктураПакета.Номенклатура = Пакет.Номенклатура;
	СтруктураПакета.ХарактеристикаНоменклатуры = Пакет.ХарактеристикаНоменклатуры;
	СтруктураПакета.Влажность = Пакет.Влажность;
	СтруктураПакета.Длина = Пакет.Длина;
	СтруктураПакета.Ширина =  Пакет.Ширина;
	СтруктураПакета.Толщина = Пакет.Толщина;
	СтруктураПакета.Объем = Пакет.Объем;
	
	Возврат СтруктураПакета;
	
КонецФункции
